Autodesk.Revit.DB.GroupTypeId.WallCrossSectionDefinition
Cross-Section Definition.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.Visibility
Visibility.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.ViewExtents
Extents.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.ViewCamera
Camera.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.Underlay
Underlay.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.TrussFamilyVertWeb
Vertical Webs.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.TrussFamilyTopChord
Top Chords.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.TrussFamilyDiagWeb
Diagonal Webs.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.TrussFamilyBottomChord
Bottom Chords.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.TranslationIn
Translation in.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.ToposolidSubdivision
Sub-Division.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.Title
Title Text.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.Text
Text.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.Termination
Terminations.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.SystemtypeRisedrop
Rise / Drop.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.Support
Supports.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.StructuralSectionGeometry
Structural Section Geometry.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.StructuralSectionDimensions
Structural Section Dimensions.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.StructuralAnalysis
Structural Analysis.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.Structural
Structural.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.StairsWinders
Winders.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.StairsTreadsRisers
Threads/Risers.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.StairsSupports
Supports.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.StairsOpenEndConnection
End Connection.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.StairsCalculatorRules
Calculation Rules.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.StairTreads
Treads.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.StairStringers
Stringers.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.StairRisers
Risers.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.SplitProfileDimensions
Dimensions     (linear units or % of thickness).
Since:
2024

Autodesk.Revit.DB.GroupTypeId.SlabShapeEdit
Slab Shape Edit.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.SegmentsFittings
Segments and Fittings.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.SecondaryEnd
Secondary End.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.RouteAnalysis
Route Analysis.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.RotationAbout
Rotation about.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.ReleasesMemberForces
Releases / Member Forces.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.Reference
Reference.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.RebarSystemLayers
Layers.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.RebarArray
Rebar Set.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.RailingSystemSegmentVGrid
V Grid.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.RailingSystemSegmentUGrid
U Grid.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.RailingSystemSegmentPosts
Posts.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.RailingSystemSegmentPatternRepeat
Pattern Repeat.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.RailingSystemSegmentPatternRemainder
Pattern Remainder.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.RailingSystemSecondaryFamilyHandrails
Handrail 2.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.RailingSystemFamilyTopRail
Top Rail.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.RailingSystemFamilySegmentPattern
Segment Pattern (default).
Since:
2024

Autodesk.Revit.DB.GroupTypeId.RailingSystemFamilyHandrails
Handrail 1.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.Profilen2
Profile 2.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.Profilen1
Profile 1.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.Profile
Profile.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.PrimaryUnits
Primary Units.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.PrimaryEnd
Primary End.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.Plumbing
Plumbing.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.Phasing
Phasing.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.PatternApplication
Pattern Application.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.Pattern
Pattern.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.OverallLegend
Overall Legend.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.Nodes
Nodes.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.Moments
Moments.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.MechanicalLoads
Mechanical - Loads.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.MechanicalAirflow
Mechanical - Flow.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.Mechanical
Mechanical.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.Materials
Materials and Finishes.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.Lining
Lining.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.LightPhotometrics
Photometrics.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.LifeSafety
Life Safety.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.Length
Length.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.Insulation
Insulation.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.Ifc
IFC Parameters.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.IdentityData
Identity Data.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.GreenBuilding
Green Building Properties.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.Graphics
Graphics.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.GeometryPositioning
Geometric Position.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.GeoLocation
Geolocation.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.General
General.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.Forces
Forces.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.Flexible
Adaptive Component.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.Fitting
Fittings.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.FireProtection
Fire Protection.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.FabricationProductData
Fabrication Product Data.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.EnergyAnalysisRoomSpaceData
Room/Space Data.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.EnergyAnalysisDetailedModel
Detailed Model.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.EnergyAnalysisDetailedAndConceptualModels
Essential.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.EnergyAnalysisConceptualModel
Energy Analytical Model.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.EnergyAnalysisBuildingData
Building Data.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.EnergyAnalysisBldgConsMtlThermalProps
Material Thermal Properties.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.EnergyAnalysisAdvanced
Advanced.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.EnergyAnalysis
Energy Analysis.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.ElectricalLoads
Electrical - Loads.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.ElectricalLighting
Electrical - Lighting.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.ElectricalEngineering
Electrical Engineering.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.ElectricalCircuiting
Electrical - Circuiting.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.ElectricalAnalysis
Electrical Analysis.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.Electrical
Electrical.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.DivisionGeometry
Division Geometry.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.Display
Display.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.Data
Data.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.CurtainMullionn2
Grid 2 Mullions.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.CurtainMullionn1
Grid 1 Mullions.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.CurtainMullionVert
Vertical Mullions.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.CurtainMullionHoriz
Horizontal Mullions.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.CurtainGridn2
Grid 2.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.CurtainGridn1
Grid 1.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.CurtainGridVert
Vertical Grid.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.CurtainGridV
V Grid.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.CurtainGridU
U Grid.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.CurtainGridHoriz
Horizontal Grid.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.CurtainGrid
Grid.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.CouplerArray
Set.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.ContinuousrailEndTopExtension
Extension (End/Top).
Since:
2024

Autodesk.Revit.DB.GroupTypeId.ContinuousrailBeginBottomExtension
Extension (Beginning/Bottom).
Since:
2024

Autodesk.Revit.DB.GroupTypeId.Construction
Construction.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.Constraints
Constraints.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.ConceptualEnergyDataBuildingServices
Energy Model - Building Services.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.ConceptualEnergyData
Conceptual Energy Data.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.Area
Area.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.AnalyticalProperties
Analytical Properties.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.AnalyticalModel
Analytical Model.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.AnalyticalAlignment
Analytical Alignment.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.AnalysisResults
Analysis Results.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.AlternateUnits
Alternate Units.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.AdskModelProperties
Model Properties.
Since:
2024

Autodesk.Revit.DB.GroupTypeId.Geometry
Geometry.
Since:
2024

Autodesk.Revit.DB.GroupTypeId
This class contains constants identifying parameter groups.
Since:
2024